# Creating DataFrame

### Creating DataFrame using dictionary

In [1]:
import pandas as pd

In [2]:
cars = {'Brand': ['Honda', 'Toyota', 'Ford', 'Audi', 'Marcedes'],
        'Price': [1000, 2000, 3000, 4000, 5000]}
cars

{'Brand': ['Honda', 'Toyota', 'Ford', 'Audi', 'Marcedes'],
 'Price': [1000, 2000, 3000, 4000, 5000]}

Use of dictionary of lists to create dataframe:
- where lists are values of the dictionary
- dictionary key will become column name

In [3]:
df = pd.DataFrame(cars)
df

      Brand  Price
0     Honda   1000
1    Toyota   2000
2      Ford   3000
3      Audi   4000
4  Marcedes   5000

In [4]:
fruits = {'fruits': ["banana", "blackberry", "blueberry"],
          'calories':[105, 31, 41] }
fruits

{'fruits': ['banana', 'blackberry', 'blueberry'], 'calories': [105, 31, 41]}

In [5]:
fruits["fruits"][0]

'banana'

In [6]:
fruitsDF = pd.DataFrame(fruits)
fruitsDF

       fruits  calories
0      banana       105
1  blackberry        31
2   blueberry        41

### Creating DataFrame using list

In [7]:
fruits = ['apple', 'banana', 'cherry', 'pineapple']
fruits

['apple', 'banana', 'cherry', 'pineapple']

In [8]:
fruits_df = pd.DataFrame(fruits)
fruits_df

           0
0      apple
1     banana
2     cherry
3  pineapple

In [9]:
fruits_df.shape

(4, 1)

In [10]:
fruits_df[0].shape

(4,)

In [11]:
names = ['GodaKhamashu', 'Paponda', 'Nannu']
age = [50, 60, 50]

In [12]:
list_of_name_age = list(zip(names, age))
list_of_name_age

[('GodaKhamashu', 50), ('Paponda', 60), ('Nannu', 50)]

In [13]:
type(list_of_name_age[0])

tuple

In [14]:
players = pd.DataFrame(list_of_name_age)
players

              0   1
0  GodaKhamashu  50
1       Paponda  60
2         Nannu  50

In [15]:
players_with_column_name = pd.DataFrame(list(zip(names, age)), columns=["Name", "Age"])
players_with_column_name

           Name  Age
0  GodaKhamashu   50
1       Paponda   60
2         Nannu   50

In [16]:
mall_customers = pd.read_csv('mall customers.csv')
mall_customers

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [17]:
mall_customers.shape

(200, 5)

In [18]:
rows, columns = mall_customers.shape
rows

200

In [19]:
columns

5

In [20]:
mall_customers.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [21]:
mall_customers.head(2)

   CustomerID Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1   Male   19                  15                      39
1           2   Male   21                  15                      81

In [22]:
mall_customers.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

#### Extract range of entries

In [23]:
mall_customers[0:5]

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [24]:
mall_customers.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [25]:
for i in mall_customers.columns:
    print(i)

CustomerID
Gender
Age
Annual Income (k$)
Spending Score (1-100)

In [26]:
mall_customers["Annual Income (k$)"]

0       15
1       15
2       16
3       16
4       17
      ...
195    120
196    126
197    126
198    137
199    137
Name: Annual Income (k$), Length: 200, dtype: int64

In [27]:
mall_customers["Annual Income (k$)"].shape

(200,)

In [28]:
type(mall_customers["Annual Income (k$)"])

pandas.core.series.Series

In [29]:
mall_customers["Annual Income (k$)"].dtype

dtype('int64')

In [30]:
mall_customers.Age

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

In [31]:
mall_customers.Age.dtype

dtype('int64')

In [32]:
mall_customers[['Gender', 'Age', 'Annual Income (k$)']]

     Gender  Age  Annual Income (k$)
0      Male   19                  15
1      Male   21                  15
2    Female   20                  16
3    Female   23                  16
4    Female   31                  17
..      ...  ...                 ...
195  Female   35                 120
196  Female   45                 126
197    Male   32                 126
198    Male   32                 137
199    Male   30                 137

[200 rows x 3 columns]

In [33]:
mall_customers[['Gender', 'Age', 'Annual Income (k$)']].shape

(200, 3)

In [34]:
mall_customers.Age.max()

70

In [35]:
mall_customers.Age.min()

18

In [36]:
mall_customers.Age.std()

13.969007331558883

In [37]:
mall_customers['Annual Income (k$)'].mean()

60.56

In [38]:
mall_customers['Annual Income (k$)'].std()

26.264721165271254

In [39]:
mall_customers['Annual Income (k$)'].mode()

0    54
1    78
Name: Annual Income (k$), dtype: int64

In [40]:
mall_customers['Annual Income (k$)'].median()

61.5

In [41]:
mall_customers.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

### Conditional operation on columns

In [42]:
mall_customers[mall_customers['Age'] > 50]

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
8             9    Male   64                  19                       3
10           11    Male   67                  19                      14
12           13  Female   58                  20                      15
18           19    Male   52                  23                      29
24           25  Female   54                  28                      14
30           31    Male   60                  30                       4
32           33    Male   53                  33                       4
40           41  Female   65                  38                      35
53           54    Male   59                  43                      60
56           57  Female   51                  44                      50
57           58    Male   69                  44                      46
59           60    Male   53                  46                      46
60           61    Male   70                  46                      56
62           63  Female   67                  47                      52
63           64  Female   54                  47                      59
64           65    Male   63                  48                      51
67           68  Female   68                  48                      48
70           71    Male   70                  49                      55
72           73  Female   60                  50                      49
73           74  Female   60                  50                      56
74           75    Male   59                  54                      47
80           81    Male   57                  54                      51
82           83    Male   67                  54                      41
86           87  Female   55                  57                      58
90           91  Female   68                  59                      55
102         103    Male   67                  62                      59
106         107  Female   66                  63                      50
107         108    Male   54                  63                      46
108         109    Male   68                  63                      43
109         110    Male   66                  63                      48
110         111    Male   65                  63                      52
116         117  Female   63                  65                      43
118         119  Female   51                  67                      43
128         129    Male   59                  71                      11
140         141  Female   57                  75                       5
160         161  Female   56                  79                      35
174         175  Female   52                  88                      13
176         177    Male   58                  88                      15
178         179    Male   59                  93                      14
186         187  Female   54                 101                      24

In [43]:
mall_customers[mall_customers['Age'] == mall_customers["Age"].min()]

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
33           34    Male   18                  33                      92
65           66    Male   18                  48                      59
91           92    Male   18                  59                      41
114         115  Female   18                  65                      48

In [44]:
mall_customers[mall_customers['Age'] == mall_customers['Age'].max()]

    CustomerID Gender  Age  Annual Income (k$)  Spending Score (1-100)
60          61   Male   70                  46                      56
70          71   Male   70                  49                      55

In [45]:
mall_customers[mall_customers['Age'] == mall_customers['Age'].median()]

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
38           39  Female   36                  37                      26
165         166  Female   36                  85                      75
168         169  Female   36                  87                      27
172         173    Male   36                  87                      10
173         174    Male   36                  87                      92
189         190  Female   36                 103                      85

In [46]:
mall_customers['Gender'][mall_customers['Age'] == mall_customers['Age'].max()]

60    Male
70    Male
Name: Gender, dtype: object

In [47]:
mall_customers['Gender'][mall_customers['Annual Income (k$)'] == mall_customers['Annual Income (k$)'].max()]

198    Male
199    Male
Name: Gender, dtype: object

### Accessing row with loc and iloc
- loc takes the index value
- iloc takes index number

In [48]:
mall_customers.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [49]:
mall_customers.loc[0]

CustomerID                   1
Gender                    Male
Age                         19
Annual Income (k$)          15
Spending Score (1-100)      39
Name: 0, dtype: object

In [50]:
mall_customers.loc[1]

CustomerID                   2
Gender                    Male
Age                         21
Annual Income (k$)          15
Spending Score (1-100)      81
Name: 1, dtype: object

In [51]:
mall_customers.loc[1:3, "Gender":"Annual Income (k$)"]

   Gender  Age  Annual Income (k$)
1    Male   21                  15
2  Female   20                  16
3  Female   23                  16

In [56]:
mall_customers.iloc[2:4, 1:3]

   Gender  Age
2  Female   20
3  Female   23

In [57]:
mall_customers.index

RangeIndex(start=0, stop=200, step=1)

In [58]:
vip = pd.read_csv("nameAge.csv")
vip

        name  age       dob gender
0  Gotidanob   50  20/02/78      m
1      Nannu   60  1/3/1980      m
2      Kader   50  2/3/1980      m
3  Hero Alom   50  5/3/1989      m

In [59]:
vip.index

RangeIndex(start=0, stop=4, step=1)

In [60]:
vip.set_index("name")

           age       dob gender
name
Gotidanob   50  20/02/78      m
Nannu       60  1/3/1980      m
Kader       50  2/3/1980      m
Hero Alom   50  5/3/1989      m

In [62]:
vip1 = vip.set_index("name")
vip1

           age       dob gender
name
Gotidanob   50  20/02/78      m
Nannu       60  1/3/1980      m
Kader       50  2/3/1980      m
Hero Alom   50  5/3/1989      m

In [63]:
vip1.loc["Nannu"]

age             60
dob       1/3/1980
gender           m
Name: Nannu, dtype: object

In [65]:
vip1.iloc[1]

age             60
dob       1/3/1980
gender           m
Name: Nannu, dtype: object

In [66]:
vip1.loc['Hero Alom']

age             50
dob       5/3/1989
gender           m
Name: Hero Alom, dtype: object

In [67]:
vip1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Gotidanob to Hero Alom
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4 non-null      int64
 1   dob     4 non-null      object
 2   gender  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

### `pd.read_csv()`

In [68]:
df = pd.read_csv("nameAge.csv")
df

        name  age       dob gender
0  Gotidanob   50  20/02/78      m
1      Nannu   60  1/3/1980      m
2      Kader   50  2/3/1980      m
3  Hero Alom   50  5/3/1989      m

In [69]:
df = pd.read_csv("nameAge.csv", header=None)
df

           0    1         2       3
0       name  age       dob  gender
1  Gotidanob   50  20/02/78       m
2      Nannu   60  1/3/1980       m
3      Kader   50  2/3/1980       m
4  Hero Alom   50  5/3/1989       m

In [70]:
df = pd.read_csv("nameAge.csv", names=["NAME", "AGE", 'DATE OF BIRTH', 'GENDER'])
df

        NAME  AGE DATE OF BIRTH  GENDER
0       name  age           dob  gender
1  Gotidanob   50      20/02/78       m
2      Nannu   60      1/3/1980       m
3      Kader   50      2/3/1980       m
4  Hero Alom   50      5/3/1989       m

In [71]:
df_to_check_if_dfchanged = pd.read_csv("nameAge.csv")
df_to_check_if_dfchanged

        name  age       dob gender
0  Gotidanob   50  20/02/78      m
1      Nannu   60  1/3/1980      m
2      Kader   50  2/3/1980      m
3  Hero Alom   50  5/3/1989      m

In [72]:
df = pd.read_csv('nameAge.csv', nrows=3)
df

        name  age       dob gender
0  Gotidanob   50  20/02/78      m
1      Nannu   60  1/3/1980      m
2      Kader   50  2/3/1980      m

In [73]:
df = pd.read_csv("nameAge.csv", skiprows=2)
df

       Nannu  60  1/3/1980  m
0      Kader  50  2/3/1980  m
1  Hero Alom  50  5/3/1989  m

In [78]:
df = pd.read_csv("nameAge.csv", header=3)

In [79]:
df

       Kader  50  2/3/1980  m
0  Hero Alom  50  5/3/1989  m